<?
	$opt = array();

//--Сайт---------------------------------------------------
	$opt["page_rating"] = 0;		//Система рейтинга страниц
	$opt["page_comments"] = 0; 		//Коментарии страниц
	$opt["page_icons"] = 0;	 		//Иконки к страницам
	$opt["page_photos"] = 1;	 	//Фотографии к страницам

	$opt["news"] = 1; 				//Новости
	$opt["news_comments"] = 0; 		//Коментарии новостей
	$opt["news_rating"] = 0;		//Система рейтинга новостей
	$opt["news_photos"] = 0;	 	//Фотографии к новостям

	$opt["articles"] = 1;       	//Статьи
	$opt["articles_comments"] = 0;	//Коментарии статей
	$opt["articles_tags"] = 0;		//Теги статей
	$opt["articles_cats"] = 0;		//Привязка статей к кетегориям
	$opt["articles_rating"] = 0;	//Система рейтинга статей

	$opt["actions"] = 1;       		//Акции
	$opt["actions_comments"] = 0;	//Коментарии акций
	$opt["actions_prods"] = 0;     	//Привязка товаров к акциям

//	$opt["vacancy"] = 0;			//Вакансии

//--Каталог------------------------------------------------
	$opt["prods"] = 1;				//Каталог
	$opt["prod_cats"] = 1;			//Категории товаров
	$opt["prod_multicats"] = 0;		//Привязка товаров к нескольким категориям
	$opt["cat_tree"] = 1;			//Дерево категорий
	$opt["prod_brands"] = 1;		//Бренды
	$opt["prod_vars"] = 1;			//Варианты приобретения
	$opt["prod_chars"] = 1;			//Характеристики товаров
	$opt["char_cats"] = 0;			//Категории характеристик
	$opt["prod_photos"] = 1;		//Доп. фото товаров
	$opt["prod_comments"] = 1;		//Комментарии к товарам
	$opt["prod_childs"] = 1;		//Сопутствующие товары
	$opt["prod_analogs"] = 1;		//Похожие товары товары
	$opt["prod_points"] = 0;		//Система начисления баллов
	$opt["prod_kit"] = 1;			//Подарки к товару
	$opt["prod_colors"] = 1;		//Варианты цветов товара
	$opt["prod_sizes"] = 1;			//Варианты размеров товара
	$opt["prod_discounts"] = 0;		//Скидки на конкретные товары
	$opt['prod_stock'] = 0;			//Остатки товаров
	$opt['prod_currency'] = 1;		//Цена товаров в валюте
	
	$opt["prod_import"] = 0;		//Импорт товаров из 1с, csv
	$opt["prod_export"] = 0;		//Экспорт товаров в 1с, csv и прайс-алрегатторы

	$opt["prod_tags"] = 1;			//Теги товаров
	$opt["prod_compare"] = 0;		//Сравнение товаров
	$opt["prod_history"] = 0;		//История просмотренных товаров
	$opt["prod_sale"] = 0;			//Распродажа
	$opt["novinki"] = 0;			//Новинки
	$opt["ext_search"] = 0;			//Расширенный поиск

	$opt["prod_rating"] = 0;		//Система рейтинга товаров
	$opt["cat_rating"] = 0;			//Система рейтинга категорий

//--Пользователи и Заказы-----------------------------------
	$opt["billing"] = 1;			//Система онлайн-заказов
	$opt["discounts"] = 0;			//Система скидок
	$opt["managers"] = 1;			//Менеджеры заказов
	$opt["referal"] = 0;			//Система рефералов

//--Корзина-------------------------------------------------
	$opt["cart"] = 1;				//Корзина
	$opt['cart_user_session'] = 0;	//Сохранение корзины для зарегистрированных пользователей
	$opt['cart_cookie'] = 0;		//Сохранение корзины в куки
	$opt['cart_weight'] = 0;		//Вес товаров в Корзине. Для автоматического расчета стоимости доставки
	
//--SEO-----------------------------------------------------
	$opt["sitemap"] = 1;			//Генерация sitemap.xml
	$opt["snippets"] = 1;			//Расширенные сниппеты

//--Региональные настройки----------------------------------
	$opt["multilang"] = 1;			//Мультиязычность
	$opt["regions"] = 0;			//Привязка к регионам
	$opt["currencies"] = 0;			//Мультивалютность

//--Дополнительно-------------------------------------------
	$opt["watermarks"] = 0;			//Водяные знаки

	$opt["photo_gallery"] = 0;		//Фотогалерея
	$opt["photo_comments"] = 0;		//Коментарии фотографий

	$opt["blog"] = 1;				//Блог
	$opt["banners"] = 1;			//Система управления баннерами

	$opt["distrib"] = 1;			//Система рассылки

	Zend_Registry::set('opt', $opt);